       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADMIN-MAIN.
       AUTHOR. Aye Min Tun.
       DATE-WRITTEN. 2026-06-16.
       
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Testing..., This is admin main".
           STOP RUN.
       END PROGRAM ADMIN-MAIN
       .
        